tests/fixtures/wssec/signed_message_prefix_variant.xml.golden

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
            xmlns:sec="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
            xmlns:sig="http://www.w3.org/2000/09/xmldsig#"
            xmlns:x="urn:example:eb">
  <s:Header>
    <sig:Signature>
      <sig:SignedInfo>
        <sig:Reference URI="#payload-1">
          <sig:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
          <sig:DigestValue>{{DIGEST}}</sig:DigestValue>
        </sig:Reference>
      </sig:SignedInfo>
    </sig:Signature>
  </s:Header>
  <s:Body>
    <x:Payload sec:Id="payload-1">ABC</x:Payload>
  </s:Body>
</s:Envelope>
